99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_monitor/esp32_mquickjs_wifi_monitor.c
#include "esp32_mquickjs_wifi_frame_type.h"
#include "esp32_mquickjs_wifi_monitor.h"
#include "esp32_mquickjs_memory.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_options.h"
#include "esp_timer.h"
#include "esp_system.h"
#include "esp32_mquickjs_wifi_monitor_options.h"
#include "esp32_mquickjs_wifi_monitor_wire.h"
#include "utils/esp32_mquickjs_byte_source.h"
#include "esp_heap_caps.h"
#include <string.h>

typedef struct {
    esp32_mquickjs_wifi_monitor_session_t *native;
    esp32_mquickjs_wifi_monitor_options_t options;
    unsigned queue_slot;
    bool configuring;
} monitor_session_t;
typedef struct {
    esp32_mquickjs_wifi_monitor_session_t *session;
    esp32_mquickjs_wifi_monitor_event_t event;
} monitor_frame_t;
typedef struct {
    esp32_mquickjs_wifi_monitor_session_t *session;
    uint32_t count, capacity;
    esp32_mquickjs_wifi_monitor_event_t events[];
} monitor_batch_t;
_Static_assert(ESP32_MQUICKJS_WIFI_MONITOR_MAX_BATCH_FRAMES <=
    (SIZE_MAX - sizeof(monitor_batch_t)) / sizeof(esp32_mquickjs_wifi_monitor_event_t),
    "Monitor Batch token allocation must fit size_t");
typedef struct {
    esp32_mquickjs_wifi_monitor_session_t *session;
    esp32_mquickjs_wifi_monitor_ref_t payload;
    size_t offset;
    bool opened, iterator_active, destroy_requested;
} monitor_reference_t;

#define SET(object, name, value) do { \
    if (!esp32_mquickjs_set_property_ref(ctx, object, name, value)) goto fail; \
} while (0)
#define NUMBER(object, name, value) SET(object, name, JS_NewFloat64(ctx, (double)(value)))

static monitor_session_t *monitor_session_from_this(JSContext *ctx, JSValue *value)
{
    if (value == NULL || JS_GetClassID(ctx, *value) != JS_CLASS_WIFI_MONITOR_SESSION) {
        JS_ThrowTypeError(ctx, "expected WiFiMonitorSession"); return NULL;
    }
    monitor_session_t *session = JS_GetOpaque(ctx, *value);
    if (session == NULL) JS_ThrowReferenceError(ctx, "invalid WiFiMonitorSession");
    return session;
}

static monitor_frame_t *monitor_frame_from_this(JSContext *ctx, JSValue *value, int argc)
{
    if (argc != 0 || value == NULL || JS_GetClassID(ctx, *value) != JS_CLASS_WIFI_MONITOR_FRAME) {
        JS_ThrowTypeError(ctx, "WiFiMonitorFrame method expects its Frame and no arguments"); return NULL;
    }
    monitor_frame_t *frame = JS_GetOpaque(ctx, *value);
    if (frame == NULL) JS_ThrowReferenceError(ctx, "WIFI_MONITOR_STALE_FRAME: frame is closed");
    return frame;
}

static JSValue monitor_error(JSContext *ctx, esp32_mquickjs_wifi_monitor_session_t *session,
    const char *operation, esp_err_t error)
{
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details)) goto fail;
    NUMBER(details, "espCode", error);
    SET(details, "espName", JS_NewString(ctx, esp_err_to_name(error)));
    const char *stage = session->capture.last_stage;
    const char *cleanup = session->capture.cleanup_stage;
    SET(details, "stage", stage != NULL ? JS_NewString(ctx, stage) : JS_NULL);
    SET(details, "cleanupStage", cleanup != NULL ? JS_NewString(ctx, cleanup) : JS_NULL);
    NUMBER(details, "cleanupEspCode", session->capture.cleanup_error);
    SET(details, "cleanupPending", JS_NewBool(session->reaper_registered || session->reaper_full ||
        session->capture.state == ESP32_MQUICKJS_WIFI_MONITOR_STOPPING));
    NUMBER(details, "generation", session->generation);
    (void)esp32_mquickjs_throw_native_error(ctx, "WIFI_MONITOR_FAILED", operation,
        "Wi-Fi Monitor operation failed; inspect details and wifi.status().radio", *details);
fail:
    JS_PopGCRef(ctx, &details_ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_monitor_session_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return JS_ThrowTypeError(ctx, "use wifi.monitor.open() to create a WiFiMonitorSession");
}
JSValue js_wifi_monitor_frame_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return JS_ThrowTypeError(ctx, "receive a WiFiMonitorFrame from a Monitor session");
}

void js_wifi_monitor_session_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    monitor_session_t *session = opaque;
    if (session == NULL) return;
    esp32_mquickjs_wifi_monitor_session_request_close(session->native);
    esp32_mquickjs_wifi_monitor_session_release(session->native);
    esp32_mquickjs_memory_payload_free(session);
}
void js_wifi_monitor_frame_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    monitor_frame_t *frame = opaque;
    if (frame == NULL) return;
    (void)esp32_mquickjs_wifi_monitor_close_frame(&frame->session->resources, &frame->event);
    esp32_mquickjs_wifi_monitor_session_release(frame->session);
    esp32_mquickjs_memory_payload_free(frame);
}

static JSValue monitor_make_frame(JSContext *ctx, const esp32_mquickjs_wifi_monitor_event_t *event,
    esp32_mquickjs_wifi_monitor_session_t *session)
{
    esp32_mquickjs_wifi_monitor_info_t snapshot;
    if (!esp32_mquickjs_wifi_monitor_frame_info(&session->resources, event, &snapshot))
        return JS_ThrowReferenceError(ctx, "WIFI_MONITOR_STALE_FRAME: invalid event owner");
    monitor_frame_t *frame = esp32_mquickjs_memory_wireless_calloc("wifi.monitor", 1, sizeof(*frame), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (frame == NULL) return JS_ThrowOutOfMemory(ctx);
    if (!esp32_mquickjs_wifi_monitor_session_retain(session)) {
        esp32_mquickjs_memory_payload_free(frame); return JS_ThrowInternalError(ctx, "Monitor context reference exhausted");
    }
    frame->session = session;
    frame->event = *event;
    JSGCRef object_ref, info_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *info = JS_PushGCRef(ctx, &info_ref);
    *info = JS_UNDEFINED;
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_MONITOR_FRAME);
    if (JS_IsException(*object)) goto fail;
    /* Ownership attaches only after every fallible JS allocation succeeds.
     * The queue bridge closes the PUBLIC root on any conversion failure. */
    *info = esp32_mquickjs_wifi_monitor_info_to_js(ctx, &snapshot, event->identity, session->capture.radio_generation);
    if (JS_IsException(*info)) goto fail;
    SET(object, "info", *info);
    JS_SetOpaque(ctx, *object, frame);
    JS_PopGCRef(ctx, &info_ref);
    return JS_PopGCRef(ctx, &object_ref);
fail:
    JS_PopGCRef(ctx, &info_ref);
    JS_PopGCRef(ctx, &object_ref);
    esp32_mquickjs_wifi_monitor_session_release(session);
    esp32_mquickjs_memory_payload_free(frame);
    return JS_EXCEPTION;
}

JSValue js_wifi_monitor_open(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc > 1) return JS_ThrowTypeError(ctx, "wifi.monitor.open expects options only");
    esp32_mquickjs_wifi_monitor_options_t options;
    if (!esp32_mquickjs_wifi_monitor_capture_options(ctx, argc == 0 ? JS_UNDEFINED : argv[0], &options))
        return JS_EXCEPTION;
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    if (runtime == NULL) return JS_ThrowInternalError(ctx, "Monitor requires an active runtime");
    monitor_session_t *session = NULL;
    JSGCRef object_ref, queue_ref, method_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *queue = JS_PushGCRef(ctx, &queue_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    *queue = *method = JS_UNDEFINED;
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_MONITOR_SESSION);
    if (JS_IsException(*object)) goto fail;
    *method = JS_GetPropertyStr(ctx, *object, "receive");
    if (JS_IsException(*method)) goto fail;
    if (!esp32_mquickjs_event_queue_register_receive_alias(ctx, runtime, *method)) {
        if (!JS_HasException(ctx)) JS_ThrowInternalError(ctx, "Monitor receive Future registration failed");
        goto fail;
    }
    session = esp32_mquickjs_memory_wireless_calloc("wifi.monitor", 1, sizeof(*session), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (session == NULL) { JS_ThrowOutOfMemory(ctx); goto fail; }
    session->options = options;
    *queue = esp32_mquickjs_wifi_monitor_session_new(ctx, runtime, &options.capture,
        options.pool_capacity, options.snap_length, options.require_complete, options.queue_capacity,
        monitor_make_frame, &session->native);
    if (JS_IsException(*queue)) goto fail;
    SET(object, "_monitorQueue0", *queue);
    SET(object, "_monitorQueue1", JS_UNDEFINED);
    esp_err_t err = esp32_mquickjs_wifi_monitor_session_start(session->native);
    if (err != ESP_OK) { (void)monitor_error(ctx, session->native, "wifi.monitor.open", err); goto fail; }
    JS_SetOpaque(ctx, *object, session);
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &queue_ref);
    return JS_PopGCRef(ctx, &object_ref);
fail:
    if (session != NULL && session->native != NULL)
        (void)esp32_mquickjs_wifi_monitor_session_close(session->native);
    if (!JS_IsUndefined(*queue) && !JS_IsException(*queue))
        (void)esp32_mquickjs_event_queue_dispose(ctx, *queue);
    if (session != NULL) {
        esp32_mquickjs_wifi_monitor_session_release(session->native);
        esp32_mquickjs_memory_payload_free(session);
    }
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &queue_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_monitor_session_get_queue(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argc; (void)argv;
    monitor_session_t *session = monitor_session_from_this(ctx, this_val);
    if (session == NULL) return JS_EXCEPTION;
    return JS_GetPropertyStr(ctx, *this_val, session->queue_slot == 0 ? "_monitorQueue0" : "_monitorQueue1");
}

JSValue js_wifi_monitor_session_configure(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    if (argc != 1) return JS_ThrowTypeError(ctx, "Monitor configure expects one complete options object");
    monitor_session_t *session = monitor_session_from_this(ctx, this_val);
    if (session == NULL) return JS_EXCEPTION;
    if (session->configuring) return JS_ThrowTypeError(ctx, "Monitor configure is already active");
    session->configuring = true;
    esp32_mquickjs_wifi_monitor_options_t options;
    if (!esp32_mquickjs_wifi_monitor_capture_options(ctx, argv[0], &options)) {
        session->configuring = false; return JS_EXCEPTION;
    }
    esp32_mquickjs_wifi_monitor_session_t *previous = session->native;
    if (previous->capture.state != ESP32_MQUICKJS_WIFI_MONITOR_STOPPED || previous->reaper_registered ||
        previous->reaper_full || atomic_load_explicit(&previous->close_requested, memory_order_acquire)) {
        session->configuring = false;
        return monitor_error(ctx, previous, "WiFiMonitorSession.configure", ESP_ERR_INVALID_STATE);
    }
    esp32_mquickjs_wifi_monitor_session_t *replacement = NULL;
    JSGCRef object_ref, queue_ref, previous_queue_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *queue = JS_PushGCRef(ctx, &queue_ref);
    JSValue *previous_queue = JS_PushGCRef(ctx, &previous_queue_ref);
    *object = *this_val; *queue = *previous_queue = JS_UNDEFINED;
    *previous_queue = js_wifi_monitor_session_get_queue(ctx, object, 0, NULL);
    if (JS_IsException(*previous_queue)) goto fail;
    if (JS_GetClassID(ctx, *previous_queue) != JS_CLASS_EVENT_QUEUE ||
        JS_GetOpaque(ctx, *previous_queue) != previous->bridge.queue) {
        JS_ThrowReferenceError(ctx, "Monitor queue ownership was modified"); goto fail;
    }
    *queue = esp32_mquickjs_wifi_monitor_session_new(ctx, esp32_mquickjs_get_active_runtime(), &options.capture,
        options.pool_capacity, options.snap_length, options.require_complete, options.queue_capacity,
        monitor_make_frame, &replacement);
    if (JS_IsException(*queue)) goto fail;
    unsigned next_slot = session->queue_slot ^ 1U;
    /* Stage a strong JS queue owner in the inactive property before any native
     * ownership change. The getter selects only the committed slot; final commit
     * changes plain C state without JS allocation or a fallible property set. */
    SET(object, next_slot == 0 ? "_monitorQueue0" : "_monitorQueue1", *queue);
    esp_err_t err = esp32_mquickjs_wifi_monitor_session_replace(previous, replacement);
    if (err != ESP_OK) { (void)monitor_error(ctx, previous, "WiFiMonitorSession.configure", err); goto fail; }
    session->native = replacement;
    session->options = options;
    session->queue_slot = next_slot;
    session->configuring = false;
    (void)esp32_mquickjs_event_queue_dispose(ctx, *previous_queue);
    esp32_mquickjs_wifi_monitor_session_release(previous);
    JS_PopGCRef(ctx, &previous_queue_ref);
    JS_PopGCRef(ctx, &queue_ref);
    JS_PopGCRef(ctx, &object_ref);
    /* Query is intentionally after commit, like wifi.configure. If this final
     * snapshot allocation fails, status still describes the committed config. */
    return js_wifi_monitor_session_status(ctx, this_val, 0, NULL);
fail:
    session->configuring = false;
    if (replacement != NULL) (void)esp32_mquickjs_wifi_monitor_session_close(replacement);
    if (!JS_IsUndefined(*queue) && !JS_IsException(*queue))
        (void)esp32_mquickjs_event_queue_dispose(ctx, *queue);
    esp32_mquickjs_wifi_monitor_session_release(replacement);
    JS_PopGCRef(ctx, &previous_queue_ref);
    JS_PopGCRef(ctx, &queue_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_monitor_session_receive(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    if (monitor_session_from_this(ctx, this_val) == NULL) return JS_EXCEPTION;
    /* Same queue contract for direct receive and Future.call: a stopped source
     * may be awaited; successful close wakes it with null after queue discard. */
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    *method = JS_GetPropertyStr(ctx, *this_val, "receive");
    JSValue result = JS_IsException(*method) ? JS_EXCEPTION : esp32_mquickjs_future_call_and_wait(
        ctx, esp32_mquickjs_get_active_runtime(), *method, *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

static JSValue monitor_lifecycle(JSContext *ctx, JSValue *this_val, int argc, unsigned operation)
{
    if (argc != 0) return JS_ThrowTypeError(ctx, "Monitor lifecycle method expects no arguments");
    monitor_session_t *session = monitor_session_from_this(ctx, this_val);
    if (session == NULL) return JS_EXCEPTION;
    if (session->configuring) return JS_ThrowTypeError(ctx, "Monitor configure is active");
    esp_err_t err = operation == 0 ? esp32_mquickjs_wifi_monitor_session_start(session->native) :
        operation == 1 ? esp32_mquickjs_wifi_monitor_session_stop(session->native) :
        esp32_mquickjs_wifi_monitor_session_close(session->native);
    if (err != ESP_OK) return monitor_error(ctx, session->native,
        operation == 0 ? "WiFiMonitorSession.start" : operation == 1 ? "WiFiMonitorSession.stop" : "WiFiMonitorSession.close", err);
    /* Native detach closes/discards the queue. Keep the closed JS queue owned by
     * this Session until GC; its control reference no longer pins the pool. */
    return operation == 2 ? JS_UNDEFINED : js_wifi_monitor_session_status(ctx, this_val, 0, NULL);
}
JSValue js_wifi_monitor_session_start(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ (void)argv; return monitor_lifecycle(ctx, this_val, argc, 0); }
JSValue js_wifi_monitor_session_stop(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ (void)argv; return monitor_lifecycle(ctx, this_val, argc, 1); }
JSValue js_wifi_monitor_session_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ (void)argv; return monitor_lifecycle(ctx, this_val, argc, 2); }

/* Read the native queue before allocating JS. Pool and queue observations have
 * independent locks and must not be presented as one atomic accounting sample. */
static JSValue monitor_queue_status(JSContext *ctx, esp32_mquickjs_event_queue_t *queue)
{
    esp32_mquickjs_event_queue_stats_t snapshot;
    if (queue == NULL || !esp32_mquickjs_event_queue_get_stats(queue, &snapshot)) return JS_NULL;
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "open", JS_NewBool(snapshot.open));
    NUMBER(result, "queued", snapshot.queued);
    NUMBER(result, "capacity", snapshot.capacity);
    NUMBER(result, "highWater", snapshot.high_water);
    SET(result, "receiverPending", JS_NewBool(snapshot.receiver_pending));
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &result_ref); return JS_EXCEPTION;
}

JSValue esp32_mquickjs_wifi_monitor_diagnostics(JSContext *ctx)
{
    esp32_mquickjs_wifi_monitor_diagnostic_t snapshots[ESP32_MQUICKJS_WIFI_MONITOR_MAX_SESSIONS];
    uint32_t unavailable;
    size_t count = esp32_mquickjs_wifi_monitor_diagnostics_snapshot(snapshots, &unavailable);
    JSGCRef result_ref, sessions_ref, item_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *sessions = JS_PushGCRef(ctx, &sessions_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    *sessions = JS_NewArray(ctx, 0);
    if (JS_IsException(*sessions)) goto fail;
    for (size_t i = 0; i < count; ++i) {
        const esp32_mquickjs_wifi_monitor_diagnostic_t *s = &snapshots[i];
        *item = JS_NewObject(ctx);
        if (JS_IsException(*item)) goto fail;
        NUMBER(item, "generation", s->generation);
        SET(item, "closed", JS_NewBool(s->closed));
        SET(item, "closeRequested", JS_NewBool(s->close_requested));
        SET(item, "retirementBlocked", JS_NewBool(s->retirement_blocked));
        SET(item, "accepting", JS_NewBool(s->resources.accepting));
        SET(item, "identityExhausted", JS_NewBool(s->resources.identity_exhausted));
        NUMBER(item, "controlBytes", sizeof(esp32_mquickjs_wifi_monitor_session_t));
        NUMBER(item, "poolBytes", s->resources.allocated_bytes);
        NUMBER(item, "freeSlots", s->resources.free_slots);
        NUMBER(item, "leasedFrames", s->resources.counters.leased_frames);
        NUMBER(item, "publishers", s->resources.counters.publishers);
        NUMBER(item, "callbacks", s->resources.counters.callbacks);
        NUMBER(item, "accepted", s->resources.counters.accepted);
        NUMBER(item, "droppedPoolFull", s->resources.counters.dropped_pool_full);
        NUMBER(item, "droppedQueueFull", s->resources.counters.dropped_queue_full);
        NUMBER(item, "droppedClosing", s->resources.counters.dropped_closing);
        if (JS_IsException(JS_SetPropertyUint32(ctx, *sessions, (uint32_t)i, *item))) goto fail;
    }
    SET(result, "sessions", *sessions);
    NUMBER(result, "unavailableSessions", unavailable);
    NUMBER(result, "capacity", ESP32_MQUICKJS_WIFI_MONITOR_MAX_SESSIONS);
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &sessions_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &sessions_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_monitor_session_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "Monitor status expects no arguments");
    monitor_session_t *session = monitor_session_from_this(ctx, this_val);
    if (session == NULL) return JS_EXCEPTION;
    esp32_mquickjs_wifi_monitor_session_t *native = session->native;
    esp32_mquickjs_wifi_monitor_snapshot_t snapshot;
    esp32_mquickjs_wifi_monitor_resources_snapshot(&native->resources, &snapshot);
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    static const char *const states[] = {"stopped", "starting", "running", "stopping", "closed"};
    SET(result, "state", JS_NewString(ctx, states[native->capture.state]));
    SET(result, "closeRequested", JS_NewBool(atomic_load_explicit(&native->close_requested, memory_order_acquire)));
    SET(result, "stopRequested", JS_NewBool(atomic_load_explicit(&native->capture.stop_requested, memory_order_acquire)));
    SET(result, "channelConflicted", JS_NewBool(atomic_load_explicit(&native->capture.channel_conflicted, memory_order_acquire)));
    SET(result, "cleanupPending", JS_NewBool(native->reaper_registered || native->reaper_full ||
        native->capture.state == ESP32_MQUICKJS_WIFI_MONITOR_STOPPING));
    SET(result, "retirementBlocked", JS_NewBool(atomic_load_explicit(&native->retirement_blocked, memory_order_acquire)));
    SET(result, "poolRetained", JS_NewBool(snapshot.initialized));
    SET(result, "accepting", JS_NewBool(snapshot.accepting));
    SET(result, "radioLeaseHeld", JS_NewBool(native->capture.radio.acquired));
    SET(result, "subscriberHeld", JS_NewBool(native->capture.promiscuous.acquired));
    SET(result, "fixedChannelHeld", JS_NewBool(native->capture.channel_claimed));
    SET(result, "queue", monitor_queue_status(ctx, native->bridge.queue));
    NUMBER(result, "generation", native->generation);
    NUMBER(result, "radioGeneration", native->capture.radio_generation);
    NUMBER(result, "requestedChannel", session->options.capture.channel);
    NUMBER(result, "startChannel", native->capture.effective_channel);
    NUMBER(result, "startChannelGeneration", native->capture.channel_generation);
    NUMBER(result, "poolCapacity", session->options.pool_capacity);
    NUMBER(result, "queueCapacity", session->options.queue_capacity);
    NUMBER(result, "snapLength", session->options.snap_length);
    SET(result, "requireComplete", JS_NewBool(session->options.require_complete));
    NUMBER(result, "allocatedPoolBytes", snapshot.allocated_bytes);
    NUMBER(result, "leasedFrames", snapshot.counters.leased_frames);
    NUMBER(result, "lastEspCode", native->capture.last_error);
    NUMBER(result, "cleanupEspCode", native->capture.cleanup_error);
    const char *stage = native->capture.last_stage, *cleanup = native->capture.cleanup_stage;
    SET(result, "lastStage", stage != NULL ? JS_NewString(ctx, stage) : JS_NULL);
    SET(result, "cleanupStage", cleanup != NULL ? JS_NewString(ctx, cleanup) : JS_NULL);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &result_ref); return JS_EXCEPTION;
}

