99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_monitor/esp32_mquickjs_wifi_monitor.c
JSValue js_wifi_monitor_session_stats(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "Monitor stats expects no arguments");
    monitor_session_t *session = monitor_session_from_this(ctx, this_val);
    if (session == NULL) return JS_EXCEPTION;
    esp32_mquickjs_wifi_monitor_snapshot_t snapshot;
    esp32_mquickjs_wifi_monitor_resources_snapshot(&session->native->resources, &snapshot);
    esp32_mquickjs_wifi_monitor_counters_t *c = &snapshot.counters;
    JSGCRef result_ref, filtered_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *filtered = JS_PushGCRef(ctx, &filtered_ref);
    *filtered = JS_UNDEFINED;
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    NUMBER(result, "callbacks", c->callbacks);
    NUMBER(result, "accepted", c->accepted);
    NUMBER(result, "droppedClosing", c->dropped_closing);
    NUMBER(result, "droppedPoolFull", c->dropped_pool_full);
    NUMBER(result, "droppedQueueFull", c->dropped_queue_full);
    NUMBER(result, "invalidCallbackData", c->invalid_callback_data);
    NUMBER(result, "droppedRequiredComplete", c->dropped_required_complete);
    NUMBER(result, "truncatedFrames", c->truncated_frames);
    NUMBER(result, "receivedBytes", c->received_bytes);
    NUMBER(result, "capturedBytes", c->captured_bytes);
    NUMBER(result, "droppedIdentityExhausted", c->dropped_identity_exhausted);
    NUMBER(result, "leasedFrames", c->leased_frames);
    NUMBER(result, "publishers", c->publishers);
    NUMBER(result, "freeSlots", snapshot.free_slots);
    SET(result, "identityExhausted", JS_NewBool(snapshot.identity_exhausted));
    *filtered = JS_NewObject(ctx);
    if (JS_IsException(*filtered)) goto fail;
    NUMBER(filtered, "invalidConfig", c->filtered[ESP32_MQUICKJS_WIFI_RX_FILTER_INVALID_CONFIG]);
    NUMBER(filtered, "invalidCallback", c->filtered[ESP32_MQUICKJS_WIFI_RX_FILTER_INVALID_CALLBACK]);
    NUMBER(filtered, "invalidHeader", c->filtered[ESP32_MQUICKJS_WIFI_RX_FILTER_INVALID_HEADER]);
    NUMBER(filtered, "rxError", c->filtered[ESP32_MQUICKJS_WIFI_RX_FILTER_RX_ERROR]);
    NUMBER(filtered, "type", c->filtered[ESP32_MQUICKJS_WIFI_RX_FILTER_TYPE]);
    NUMBER(filtered, "subtype", c->filtered[ESP32_MQUICKJS_WIFI_RX_FILTER_SUBTYPE]);
    NUMBER(filtered, "mac", c->filtered[ESP32_MQUICKJS_WIFI_RX_FILTER_MAC]);
    NUMBER(filtered, "rssi", c->filtered[ESP32_MQUICKJS_WIFI_RX_FILTER_RSSI]);
    NUMBER(filtered, "decimation", c->filtered[ESP32_MQUICKJS_WIFI_RX_FILTER_DECIMATION]);
    NUMBER(filtered, "rate", c->filtered[ESP32_MQUICKJS_WIFI_RX_FILTER_RATE]);
    SET(result, "filtered", *filtered);
    JS_PopGCRef(ctx, &filtered_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &filtered_ref);
    JS_PopGCRef(ctx, &result_ref); return JS_EXCEPTION;
}

JSValue js_wifi_monitor_capabilities(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "Monitor capabilities expects no arguments");
    JSGCRef result_ref, child_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *child = JS_PushGCRef(ctx, &child_ref);
    *child = JS_UNDEFINED;
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "apiVersion", JS_NewString(ctx, "wifi-monitor/1"));
    SET(result, "available", JS_TRUE);
    SET(result, "stability", JS_NewString(ctx, "candidate"));
    SET(result, "target", JS_NewString(ctx, CONFIG_IDF_TARGET));
    SET(result, "idfVersion", JS_NewString(ctx, esp_get_idf_version()));
    SET(result, "timestampAccuracy", JS_NewString(ctx, "callback-time"));
    *child = JS_NewArray(ctx, 0);
    if (JS_IsException(*child)) goto fail;
    static const char *const frame_types[] = {"management", "control", "data", "misc"};
    for (unsigned i = 0; i < sizeof(frame_types) / sizeof(frame_types[0]); ++i) {
        JSValue value = JS_NewString(ctx, frame_types[i]);
        if (JS_IsException(value) || JS_IsException(JS_SetPropertyUint32(ctx, *child, i, value))) goto fail;
    }
    SET(result, "packetTypes", *child);
    *child = esp32_mquickjs_wifi_frame_types_to_js(ctx);
    if (JS_IsException(*child)) goto fail;
    SET(result, "frameTypes", *child);
    *child = JS_NewObject(ctx);
    if (JS_IsException(*child)) goto fail;
    SET(child, "receive", JS_TRUE);
    SET(child, "frameSource", JS_TRUE);
    SET(child, "receiveBatch", JS_TRUE);
    SET(child, "configure", JS_TRUE);
    SET(child, "fixedChannel", JS_TRUE);
    SET(child, "typeFilter", JS_TRUE);
    SET(child, "subtypeFilter", JS_TRUE);
    SET(child, "frameFilter", JS_TRUE);
    SET(child, "sourceMacFilter", JS_TRUE);
    SET(child, "destinationMacFilter", JS_TRUE);
    SET(child, "bssidFilter", JS_TRUE);
    SET(child, "rssiFilter", JS_TRUE);
    SET(child, "nativeDecimation", JS_TRUE);
    SET(child, "nativeRateLimit", JS_TRUE);
    SET(child, "wireSource", JS_TRUE);
    SET(child, "hostPcapngConverter", JS_TRUE);
    SET(result, "supports", *child);
    *child = JS_NewObject(ctx);
    if (JS_IsException(*child)) goto fail;
    NUMBER(child, "maxSessions", ESP32_MQUICKJS_WIFI_MONITOR_MAX_SESSIONS);
    NUMBER(child, "maxPoolCapacity", ESP32_MQUICKJS_NATIVE_POOL_MAX_CAPACITY);
    NUMBER(child, "maxQueueCapacity", ESP32_MQUICKJS_NATIVE_POOL_MAX_CAPACITY);
    NUMBER(child, "maxSnapLength", ESP32_MQUICKJS_WIFI_MONITOR_MAX_SNAP_LENGTH);
    NUMBER(child, "maxBatchFrames", ESP32_MQUICKJS_WIFI_MONITOR_MAX_BATCH_FRAMES);
    NUMBER(child, "maxMacsPerRole", ESP32_MQUICKJS_WIFI_RX_FILTER_MAC_CAPACITY);
    SET(result, "limits", *child);
    JS_PopGCRef(ctx, &child_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &child_ref);
    JS_PopGCRef(ctx, &result_ref); return JS_EXCEPTION;
}

static void monitor_reference_release_payload(monitor_reference_t *reference)
{
    if (reference->session == NULL) return;
    (void)esp32_mquickjs_wifi_monitor_release_ref(&reference->payload);
    esp32_mquickjs_wifi_monitor_session_release(reference->session);
    reference->session = NULL;
}
static void monitor_view_release(void *opaque)
{
    monitor_reference_t *reference = opaque;
    if (reference == NULL) return;
    monitor_reference_release_payload(reference);
    esp32_mquickjs_memory_payload_free(reference);
}
static monitor_reference_t *monitor_frame_retain(JSContext *ctx, monitor_frame_t *frame)
{
    monitor_reference_t *reference = esp32_mquickjs_memory_wireless_calloc("wifi.monitor", 1, sizeof(*reference), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (reference == NULL) { JS_ThrowOutOfMemory(ctx); return NULL; }
    if (!esp32_mquickjs_wifi_monitor_session_retain(frame->session)) {
        esp32_mquickjs_memory_payload_free(reference); JS_ThrowInternalError(ctx, "Monitor context reference exhausted"); return NULL;
    }
    reference->session = frame->session;
    if (!esp32_mquickjs_wifi_monitor_retain_frame(&frame->session->resources, &frame->event, &reference->payload)) {
        monitor_view_release(reference);
        JS_ThrowReferenceError(ctx, "WIFI_MONITOR_STALE_FRAME: cannot retain frame"); return NULL;
    }
    return reference;
}

JSValue js_wifi_monitor_frame_bytes(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argv;
    monitor_frame_t *frame = monitor_frame_from_this(ctx, this_val, argc);
    if (frame == NULL) return JS_EXCEPTION;
    monitor_reference_t *reference = monitor_frame_retain(ctx, frame);
    if (reference == NULL) return JS_EXCEPTION;
    const uint8_t *data; size_t length;
    if (!esp32_mquickjs_wifi_monitor_ref_data(&reference->payload, &data, &length)) {
        monitor_view_release(reference); return JS_ThrowReferenceError(ctx, "Monitor bytes unavailable");
    }
    return esp32_mquickjs_new_wireless_retained_byte_view("wifi.monitor", ctx, data, length, monitor_view_release, reference);
}
JSValue js_wifi_monitor_frame_copy_bytes(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argv;
    monitor_frame_t *frame = monitor_frame_from_this(ctx, this_val, argc);
    if (frame == NULL) return JS_EXCEPTION;
    monitor_reference_t *reference = monitor_frame_retain(ctx, frame);
    if (reference == NULL) return JS_EXCEPTION;
    const uint8_t *data; size_t length;
    if (!esp32_mquickjs_wifi_monitor_ref_data(&reference->payload, &data, &length)) {
        monitor_view_release(reference); return JS_ThrowReferenceError(ctx, "Monitor bytes unavailable");
    }
    uint8_t *copy = length != 0 ? esp32_mquickjs_memory_wireless_alloc("wifi.monitor", length, ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_COPY) : NULL;
    if (length != 0 && copy == NULL) { monitor_view_release(reference); return JS_ThrowOutOfMemory(ctx); }
    if (length != 0) memcpy(copy, data, length);
    monitor_view_release(reference);
    return esp32_mquickjs_new_wireless_owned_byte_view("wifi.monitor", ctx, copy, length);
}
JSValue js_wifi_monitor_frame_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argv;
    if (argc != 0 || this_val == NULL || JS_GetClassID(ctx, *this_val) != JS_CLASS_WIFI_MONITOR_FRAME)
        return JS_ThrowTypeError(ctx, "WiFiMonitorFrame.close expects its Frame and no arguments");
    monitor_frame_t *frame = JS_GetOpaque(ctx, *this_val);
    JS_SetOpaque(ctx, *this_val, NULL);
    js_wifi_monitor_frame_finalizer(ctx, frame);
    return JS_UNDEFINED;
}

static bool monitor_source_next(JSContext *ctx, void *opaque, esp32_mquickjs_byte_span_t *out)
{
    (void)ctx;
    monitor_reference_t *reference = opaque;
    const uint8_t *data; size_t length;
    if (reference->session == NULL || !esp32_mquickjs_wifi_monitor_ref_data(&reference->payload, &data, &length) ||
        reference->offset >= length) return false;
    out->data = data + reference->offset;
    out->length = length - reference->offset;
    out->owner = JS_UNDEFINED;
    out->dma_capable = false;
    reference->offset = length;
    return true;
}
static void monitor_source_iterator_close(JSContext *ctx, void *opaque)
{
    (void)ctx;
    monitor_reference_t *reference = opaque;
    reference->iterator_active = false;
    monitor_reference_release_payload(reference);
    if (reference->destroy_requested) esp32_mquickjs_memory_payload_free(reference);
}
static bool monitor_source_open(JSContext *ctx, JSValue owner, void *opaque,
    esp32_mquickjs_byte_span_source_t *out, JSValue *out_error)
{
    (void)owner;
    monitor_reference_t *reference = opaque;
    if (reference->opened || reference->session == NULL) {
        *out_error = JS_ThrowReferenceError(ctx, "Monitor Source is closed or consumed"); return false;
    }
    reference->opened = true;
    reference->iterator_active = true;
    *out = (esp32_mquickjs_byte_span_source_t){reference, monitor_source_next, monitor_source_iterator_close};
    return true;
}
static size_t monitor_source_length(void *opaque)
{
    monitor_reference_t *reference = opaque;
    const uint8_t *data; size_t length;
    return reference->session != NULL && esp32_mquickjs_wifi_monitor_ref_data(&reference->payload, &data, &length) ? length : 0;
}
static void monitor_source_destroy(JSContext *ctx, void *opaque)
{
    (void)ctx;
    monitor_reference_t *reference = opaque;
    if (reference->iterator_active) reference->destroy_requested = true;
    else monitor_view_release(reference);
}
static const esp32_mquickjs_byte_span_source_object_ops_t monitor_source_ops = {
    .class_id = JS_CLASS_BYTE_SPAN_SOURCE, .open = monitor_source_open,
    .known_length = monitor_source_length, .destroy = monitor_source_destroy,
};
JSValue js_wifi_monitor_frame_source(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argv;
    monitor_frame_t *frame = monitor_frame_from_this(ctx, this_val, argc);
    if (frame == NULL) return JS_EXCEPTION;
    monitor_reference_t *reference = monitor_frame_retain(ctx, frame);
    if (reference == NULL) return JS_EXCEPTION;
    return esp32_mquickjs_new_wireless_byte_span_source("wifi.monitor", ctx, JS_UNDEFINED, &monitor_source_ops, reference);
}
/* Source owns one Session reference and one linear payload reference per frame.
 * No public Batch/Frame pointers survive creation or user option evaluation. */
typedef struct {
    esp32_mquickjs_wifi_monitor_session_t *session;
    uint8_t *control;
    uint32_t count, retained, index, control_length, total_length;
    uint8_t padding_pending;
    bool opened, iterator_active, destroy_requested, control_emitted;
    esp32_mquickjs_wifi_monitor_ref_t payloads[];
} monitor_wire_source_t;
_Static_assert(ESP32_MQUICKJS_WIFI_RX_WIRE_MAX_FRAMES <=
    (SIZE_MAX - sizeof(monitor_wire_source_t)) / sizeof(esp32_mquickjs_wifi_monitor_ref_t),
    "Monitor wire Source references must fit size_t");

static void monitor_wire_source_release(monitor_wire_source_t *source)
{
    for (uint32_t i = 0; i < source->retained; ++i)
        (void)esp32_mquickjs_wifi_monitor_release_ref(&source->payloads[i]);
    source->retained = 0;
    if (source->session != NULL) {
        esp32_mquickjs_wifi_monitor_session_release(source->session);
        source->session = NULL;
    }
    esp32_mquickjs_memory_payload_free(source->control);
    source->control = NULL;
}

/* Runtime-task-only: PUBLIC roots and metadata are stable throughout this
 * allocation-only helper. It never executes JS or accesses driver pointers. */
static monitor_wire_source_t *monitor_wire_source_create(
    esp32_mquickjs_wifi_monitor_session_t *session,
    const esp32_mquickjs_wifi_monitor_event_t *events, uint32_t count, bool *invalid)
{
    *invalid = true;
    if (session == NULL || events == NULL || count == 0 || count > ESP32_MQUICKJS_WIFI_RX_WIRE_MAX_FRAMES)
        return NULL;
    *invalid = false;
    monitor_wire_source_t *source = esp32_mquickjs_memory_wireless_calloc("wifi.monitor", 1, sizeof(*source) + (size_t)count * sizeof(source->payloads[0]), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (source == NULL) return NULL;
    esp32_mquickjs_wifi_rx_wire_frame_t *frames = esp32_mquickjs_memory_wireless_calloc("wifi.monitor", count, sizeof(*frames), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_COPY);
    if (frames == NULL) goto fail;
    *invalid = true;
    if (!esp32_mquickjs_wifi_monitor_session_retain(session)) goto fail;
    source->session = session;
    source->count = count;
    esp32_mquickjs_wifi_monitor_info_t info;
    esp32_mquickjs_wifi_monitor_wire_snapshot_t snapshot;
    for (uint32_t i = 0; i < count; ++i) {
        if (!esp32_mquickjs_wifi_monitor_retain_frame(&session->resources, &events[i], &source->payloads[i])) goto fail;
        ++source->retained;
        const uint8_t *data; size_t length;
        if (!esp32_mquickjs_wifi_monitor_frame_info(&session->resources, &events[i], &info) ||
            !esp32_mquickjs_wifi_monitor_wire_snapshot(&info, events[i].identity, events[i].generation,
                session->capture.radio_generation, &snapshot) ||
            !esp32_mquickjs_wifi_monitor_ref_data(&source->payloads[i], &data, &length) ||
            length != snapshot.frame.packet_length) goto fail;
        frames[i] = snapshot.frame;
    }
    esp32_mquickjs_wifi_rx_wire_layout_t layout;
    if (!esp32_mquickjs_wifi_rx_wire_layout(ESP32_MQUICKJS_WIFI_RX_WIRE_MONITOR, frames, count, &layout)) goto fail;
    source->control = esp32_mquickjs_memory_wireless_calloc("wifi.monitor", 1, layout.control_bytes, ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_COPY);
    if (source->control == NULL) { *invalid = false; goto fail; }
    source->control_length = layout.control_bytes;
    source->total_length = layout.total_bytes;
    if (!esp32_mquickjs_wifi_rx_wire_write_control(ESP32_MQUICKJS_WIFI_RX_WIRE_MONITOR,
            frames, count, source->control, source->control_length)) goto fail;
    for (uint32_t i = 0; i < count; ++i) {
        if (!esp32_mquickjs_wifi_monitor_frame_info(&session->resources, &events[i], &info) ||
            !esp32_mquickjs_wifi_monitor_wire_snapshot(&info, events[i].identity, events[i].generation,
                session->capture.radio_generation, &snapshot) ||
            !esp32_mquickjs_wifi_rx_wire_write_metadata(ESP32_MQUICKJS_WIFI_RX_WIRE_MONITOR,
                &frames[i], &snapshot.metadata,
                source->control + layout.metadata_base + (size_t)i * ESP32_MQUICKJS_WIFI_RX_WIRE_METADATA_BYTES,
                ESP32_MQUICKJS_WIFI_RX_WIRE_METADATA_BYTES)) goto fail;
    }
    esp32_mquickjs_memory_payload_free(frames);
    *invalid = false;
    return source;
fail:
    esp32_mquickjs_memory_payload_free(frames);
    monitor_wire_source_release(source);
    esp32_mquickjs_memory_payload_free(source);
    return NULL;
}

static bool monitor_wire_source_next(JSContext *ctx, void *opaque, esp32_mquickjs_byte_span_t *out)
{
    static const uint8_t padding[3] = {0};
    monitor_wire_source_t *source = opaque;
    if (source->session == NULL) return false;
    *out = (esp32_mquickjs_byte_span_t){.owner = JS_UNDEFINED, .dma_capable = false};
    if (!source->control_emitted) {
        source->control_emitted = true;
        out->data = source->control; out->length = source->control_length;
        return true;
    }
    if (source->padding_pending != 0) {
        out->data = padding; out->length = source->padding_pending;
        source->padding_pending = 0;
        return true;
    }
    while (source->index < source->count) {
        const uint8_t *data; size_t length;
        if (!esp32_mquickjs_wifi_monitor_ref_data(&source->payloads[source->index], &data, &length)) {
            JS_ThrowReferenceError(ctx, "WIFI_MONITOR_INVALID_DATA: retained Source payload unavailable"); return false;
        }
        ++source->index;
        if (length == 0) continue; /* Metadata-only record has no packet span. */
        out->data = data; out->length = length;
        source->padding_pending = (uint8_t)((4U - (length & 3U)) & 3U);
        return true;
    }
    return false;
}
static void monitor_wire_source_iterator_close(JSContext *ctx, void *opaque)
{
    (void)ctx;
    monitor_wire_source_t *source = opaque;
    source->iterator_active = false;
    monitor_wire_source_release(source);
    if (source->destroy_requested) esp32_mquickjs_memory_payload_free(source);
}
static bool monitor_wire_source_open(JSContext *ctx, JSValue owner, void *opaque,
    esp32_mquickjs_byte_span_source_t *out, JSValue *out_error)
{
    (void)owner;
    monitor_wire_source_t *source = opaque;
    if (source->opened || source->session == NULL) {
        *out_error = JS_ThrowReferenceError(ctx, "Monitor wire Source is closed or consumed"); return false;
    }
    source->opened = source->iterator_active = true;
    *out = (esp32_mquickjs_byte_span_source_t){source, monitor_wire_source_next, monitor_wire_source_iterator_close};
    return true;
}
static size_t monitor_wire_source_length(void *opaque)
{ return ((monitor_wire_source_t *)opaque)->total_length; }
static void monitor_wire_source_destroy(JSContext *ctx, void *opaque)
{
    (void)ctx;
    monitor_wire_source_t *source = opaque;
    if (source->iterator_active) source->destroy_requested = true;
    else { monitor_wire_source_release(source); esp32_mquickjs_memory_payload_free(source); }
}
static const esp32_mquickjs_byte_span_source_object_ops_t monitor_wire_source_ops = {
    .class_id = JS_CLASS_BYTE_SPAN_SOURCE, .open = monitor_wire_source_open,
    .known_length = monitor_wire_source_length, .destroy = monitor_wire_source_destroy,
};
