99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_monitor/esp32_mquickjs_wifi_monitor.c
JSValue js_wifi_monitor_batch_source(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    static const char *const allowed[] = {"format"};
    static const char *const formats[] = {"esp32qjs-monitor/1"};
    if (argc != 1 || this_val == NULL || JS_GetClassID(ctx, *this_val) != JS_CLASS_WIFI_MONITOR_BATCH)
        return JS_ThrowTypeError(ctx, "WiFiMonitorBatch.source expects its Batch and {format: 'esp32qjs-monitor/1'}");
    if (!esp32_mquickjs_validate_plain_options(ctx, argv[0], "WiFiMonitorBatch.source", allowed, 1))
        return JS_EXCEPTION;
    JSValue format = JS_GetPropertyStr(ctx, argv[0], "format");
    if (JS_IsException(format)) return JS_EXCEPTION;
    size_t selected;
    if (!esp32_mquickjs_value_to_enum(ctx, format, formats, 1, &selected))
        return JS_ThrowTypeError(ctx, "Monitor batch source format must be esp32qjs-monitor/1");
    /* A getter may have closed the Batch. Resolve only after option capture. */
    monitor_batch_t *batch = JS_GetOpaque(ctx, *this_val);
    if (batch == NULL) return JS_ThrowReferenceError(ctx, "WIFI_MONITOR_STALE_BATCH: batch is closed");
    bool invalid;
    monitor_wire_source_t *source = monitor_wire_source_create(batch->session, batch->events, batch->count, &invalid);
    if (source == NULL) return invalid ?
        JS_ThrowInternalError(ctx, "WIFI_MONITOR_INVALID_DATA: cannot retain and encode batch") : JS_ThrowOutOfMemory(ctx);
    return esp32_mquickjs_new_wireless_byte_span_source("wifi.monitor", ctx, JS_UNDEFINED, &monitor_wire_source_ops, source);
}

JSValue js_wifi_monitor_batch_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return JS_ThrowTypeError(ctx, "receive a WiFiMonitorBatch from a Monitor session");
}

static void monitor_batch_release(monitor_batch_t *batch)
{
    if (batch == NULL) return;
    for (uint32_t i = 0; i < batch->count; ++i)
        (void)esp32_mquickjs_wifi_monitor_close_frame(&batch->session->resources, &batch->events[i]);
    esp32_mquickjs_wifi_monitor_session_release(batch->session);
    esp32_mquickjs_memory_payload_free(batch);
}
void js_wifi_monitor_batch_finalizer(JSContext *ctx, void *opaque)
{ (void)ctx; monitor_batch_release(opaque); }

/* Transfers the Frame's existing PUBLIC root; it does not retain/copy payload.
 * Batch already owns an independent Session reference before any JS allocation. */
static bool monitor_batch_adopt_frame(JSContext *ctx, monitor_batch_t *batch, JSValue *value)
{
    if (JS_GetClassID(ctx, *value) != JS_CLASS_WIFI_MONITOR_FRAME) {
        JS_ThrowInternalError(ctx, "Monitor batch received an invalid Frame"); return false;
    }
    monitor_frame_t *frame = JS_GetOpaque(ctx, *value);
    if (frame == NULL || frame->session != batch->session || batch->count >= batch->capacity) {
        JS_ThrowReferenceError(ctx, "Monitor batch Frame belongs to another capture or is closed"); return false;
    }
    batch->events[batch->count++] = frame->event;
    JS_SetOpaque(ctx, *value, NULL);
    esp32_mquickjs_wifi_monitor_session_release(frame->session);
    esp32_mquickjs_memory_payload_free(frame);
    *value = JS_UNDEFINED;
    return true;
}

static bool monitor_batch_adopt_event(monitor_batch_t *batch,
    const esp32_mquickjs_wifi_monitor_event_t *event)
{
    if (batch->count >= batch->capacity ||
        !esp32_mquickjs_wifi_monitor_take_event(&batch->session->resources, event)) return false;
    batch->events[batch->count++] = *event;
    return true;
}

static bool monitor_batch_receiver_available(JSContext *ctx, esp32_mquickjs_event_queue_t *queue)
{
    esp32_mquickjs_event_queue_stats_t stats;
    if (!esp32_mquickjs_event_queue_get_stats(queue, &stats)) {
        JS_ThrowReferenceError(ctx, "Monitor receive queue is unavailable"); return false;
    }
    if (stats.receiver_pending) {
        JS_ThrowInternalError(ctx, "Monitor receive queue already has a pending receiver"); return false;
    }
    return true;
}

JSValue js_wifi_monitor_session_receive_batch(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    if (argc > 1) return JS_ThrowTypeError(ctx, "Monitor receiveBatch expects at most one options argument");
    monitor_session_t *owner = monitor_session_from_this(ctx, this_val);
    if (owner == NULL) return JS_EXCEPTION;
    uint32_t generation = owner->native->generation;
    esp32_mquickjs_wifi_monitor_batch_options_t options;
    if (!esp32_mquickjs_wifi_monitor_capture_batch_options(ctx, argc == 0 ? JS_UNDEFINED : argv[0],
            owner->options.pool_capacity, &options)) return JS_EXCEPTION;
    if (owner->native->generation != generation)
        return JS_ThrowReferenceError(ctx, "Monitor configuration changed during batch option capture");
    /* Pin the original native owner and queue. Cooperative waits may run JS that
     * closes/reconfigures the public Session; a Batch never follows its new slot. */
    esp32_mquickjs_wifi_monitor_session_t *session = owner->native;
    if (atomic_load_explicit(&session->closed, memory_order_acquire)) return JS_NULL;
    esp32_mquickjs_event_queue_t *native_queue = session->bridge.queue;
    if (native_queue == NULL || !esp32_mquickjs_event_queue_retain(native_queue))
        return JS_ThrowReferenceError(ctx, "Monitor batch queue cannot be retained");
    if (!esp32_mquickjs_wifi_monitor_session_retain(session)) {
        esp32_mquickjs_event_queue_release(native_queue);
        return JS_ThrowInternalError(ctx, "Monitor context reference exhausted");
    }
    size_t bytes = sizeof(monitor_batch_t) + (size_t)options.maximum_frames * sizeof(esp32_mquickjs_wifi_monitor_event_t);
    monitor_batch_t *batch = esp32_mquickjs_memory_wireless_calloc("wifi.monitor", 1, bytes, ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (batch == NULL) {
        esp32_mquickjs_wifi_monitor_session_release(session);
        esp32_mquickjs_event_queue_release(native_queue);
        return JS_ThrowOutOfMemory(ctx);
    }
    batch->session = session;
    batch->capacity = options.maximum_frames;
    JSGCRef queue_ref, frame_ref, object_ref, argument_ref;
    JSValue *queue = JS_PushGCRef(ctx, &queue_ref);
    JSValue *frame = JS_PushGCRef(ctx, &frame_ref);
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *argument = JS_PushGCRef(ctx, &argument_ref);
    *queue = *frame = *object = *argument = JS_UNDEFINED;
    *queue = js_wifi_monitor_session_get_queue(ctx, this_val, 0, NULL);
    if (JS_IsException(*queue)) goto fail;
    if (JS_GetClassID(ctx, *queue) != JS_CLASS_EVENT_QUEUE || JS_GetOpaque(ctx, *queue) != native_queue) {
        JS_ThrowReferenceError(ctx, "Monitor batch queue ownership was modified"); goto fail;
    }
    if (!monitor_batch_receiver_available(ctx, native_queue)) goto fail;
    if (options.timeout_set) {
        *argument = JS_NewUint32(ctx, options.timeout_ms);
        if (JS_IsException(*argument)) goto fail;
    }
    *frame = js_event_queue_receive(ctx, queue, options.timeout_set ? 1 : 0, options.timeout_set ? argument : NULL);
    if (JS_IsException(*frame)) goto fail;
    if (JS_IsNull(*frame)) { *object = JS_NULL; goto done; }
    if (!monitor_batch_adopt_frame(ctx, batch, frame)) goto fail;
    int64_t deadline = esp_timer_get_time() + (int64_t)options.maximum_latency_ms * 1000;
    for (;;) {
        /* All native receive admission runs on this runtime task. Check before
         * raw queue draining so a competing receiver never loses its packet. */
        if (!monitor_batch_receiver_available(ctx, native_queue)) goto fail;
        while (batch->count < batch->capacity) {
            esp32_mquickjs_wifi_monitor_event_t event;
            if (!esp32_mquickjs_event_queue_try_receive(native_queue, &event)) break;
            if (!monitor_batch_adopt_event(batch, &event)) {
                (void)esp32_mquickjs_wifi_monitor_discard_event(&session->resources, &event);
                JS_ThrowReferenceError(ctx, "Monitor batch received a stale queue token"); goto fail;
            }
        }
        int64_t remaining = deadline - esp_timer_get_time();
        if (batch->count >= options.minimum_frames || batch->count >= batch->capacity ||
            options.maximum_latency_ms == 0 || remaining <= 0 || esp32_mquickjs_event_queue_is_closed(native_queue)) break;
        *argument = JS_NewUint32(ctx, (uint32_t)((remaining + 999) / 1000));
        if (JS_IsException(*argument)) goto fail;
        *frame = js_event_queue_receive(ctx, queue, 1, argument);
        if (JS_IsException(*frame)) goto fail;
        if (JS_IsNull(*frame)) { *frame = JS_UNDEFINED; break; }
        if (!monitor_batch_adopt_frame(ctx, batch, frame)) goto fail;
    }
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_MONITOR_BATCH);
    if (JS_IsException(*object)) goto fail;
    SET(object, "frameCount", JS_NewUint32(ctx, batch->count));
    JS_SetOpaque(ctx, *object, batch);
    batch = NULL;
done:
    monitor_batch_release(batch);
    esp32_mquickjs_event_queue_release(native_queue);
    JS_PopGCRef(ctx, &argument_ref);
    JSValue result = JS_PopGCRef(ctx, &object_ref);
    JS_PopGCRef(ctx, &frame_ref);
    JS_PopGCRef(ctx, &queue_ref);
    return result;
fail:
    if (!JS_IsException(*frame) && JS_GetClassID(ctx, *frame) == JS_CLASS_WIFI_MONITOR_FRAME)
        (void)js_wifi_monitor_frame_close(ctx, frame, 0, NULL);
    monitor_batch_release(batch);
    esp32_mquickjs_event_queue_release(native_queue);
    JS_PopGCRef(ctx, &argument_ref);
    JS_PopGCRef(ctx, &object_ref);
    JS_PopGCRef(ctx, &frame_ref);
    JS_PopGCRef(ctx, &queue_ref);
    return JS_EXCEPTION;
}

