99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_monitor/esp32_mquickjs_wifi_monitor.c
static monitor_batch_t *monitor_batch_from_this(JSContext *ctx, JSValue *value, int argc, JSValue *argv,
    uint32_t *index)
{
    if (value == NULL || JS_GetClassID(ctx, *value) != JS_CLASS_WIFI_MONITOR_BATCH || argc != 1) {
        JS_ThrowTypeError(ctx, "Monitor Batch method expects its Batch and one index"); return NULL;
    }
    monitor_batch_t *batch = JS_GetOpaque(ctx, *value);
    if (batch == NULL) { JS_ThrowReferenceError(ctx, "WIFI_MONITOR_STALE_BATCH: batch is closed"); return NULL; }
    if (!esp32_mquickjs_value_to_bounded_u32(ctx, argv[0], 0, batch->count - 1, index)) {
        if (!JS_HasException(ctx)) JS_ThrowRangeError(ctx, "Monitor Batch index is outside frameCount");
        return NULL;
    }
    return batch;
}
JSValue js_wifi_monitor_batch_info(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    uint32_t index;
    monitor_batch_t *batch = monitor_batch_from_this(ctx, this_val, argc, argv, &index);
    if (batch == NULL) return JS_EXCEPTION;
    esp32_mquickjs_wifi_monitor_info_t info;
    if (!esp32_mquickjs_wifi_monitor_frame_info(&batch->session->resources, &batch->events[index], &info))
        return JS_ThrowReferenceError(ctx, "WIFI_MONITOR_STALE_BATCH: frame owner is unavailable");
    return esp32_mquickjs_wifi_monitor_info_to_js(ctx, &info, batch->events[index].identity, batch->session->capture.radio_generation);
}
JSValue js_wifi_monitor_batch_bytes(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    uint32_t index;
    monitor_batch_t *batch = monitor_batch_from_this(ctx, this_val, argc, argv, &index);
    if (batch == NULL) return JS_EXCEPTION;
    monitor_frame_t frame = {.session = batch->session, .event = batch->events[index]};
    monitor_reference_t *reference = monitor_frame_retain(ctx, &frame);
    if (reference == NULL) return JS_EXCEPTION;
    const uint8_t *data; size_t length;
    if (!esp32_mquickjs_wifi_monitor_ref_data(&reference->payload, &data, &length)) {
        monitor_view_release(reference); return JS_ThrowReferenceError(ctx, "Monitor Batch bytes unavailable");
    }
    return esp32_mquickjs_new_wireless_retained_byte_view("wifi.monitor", ctx, data, length, monitor_view_release, reference);
}
JSValue js_wifi_monitor_batch_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argv;
    if (argc != 0 || this_val == NULL || JS_GetClassID(ctx, *this_val) != JS_CLASS_WIFI_MONITOR_BATCH)
        return JS_ThrowTypeError(ctx, "Monitor Batch close expects its Batch and no arguments");
    monitor_batch_t *batch = JS_GetOpaque(ctx, *this_val);
    JS_SetOpaque(ctx, *this_val, NULL);
    monitor_batch_release(batch);
    return JS_UNDEFINED;
}

#undef SET
#undef NUMBER
#endif
